Repository: evroandrew/Dp-217_Python
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Ваші результати
ru: Ваши результаты

source: Ви не пройшли опитування
ru: Нет результатов опросов

source: Результат опитування не знайдено
ru: Результат опроса не найден

source: Посилання на пошук:
ru: Поиск:

source: схильність не виражена
ru: склонность не выражена

source: середньо виражена схильність
ru: средне выраженная склонность

source: вкрай виражену схильність
ru: крайне выраженная склонность

source: інтерес виражений слабо
ru: интерес выражен слабо

source: виражений інтерес
ru: выраженный интерес

source: яскраво виражений інтерес
ru: ярко выраженный интерес

source: Професії типу «Людина -
ru: Профессии типа «Человек -

source: Людина
ru: Человек

source: Тест на визначення профорієнтації
ru: Тест на определение профориаентации

source: Тест на визначення типу майбутньої професії
ru: Тест на определение типа будущей профессии

source: з
ru: из

source: балів
ru: балов

source: Почати тест
ru: Начать тест

source: Вибір професії один з найважливіших етапів в життя
ru: Выбор профессии является одним из важнейших этапов жизни

source: людини, адже велика частина часу неспання (близько 60%%) йде на роботу, підготовку і дорогу до неї
ru: человека, ведь большая часть времени бодрствования (около 60%%) идет на работу, подготовку и дорогу до нее

source: Від спеціальності залежить, в яких колах відбувається спілкування і чи будуть колеги сприяти
ru: От специальности зависит, в каких кругах происходит общение и будут ли коллеги содействовать

source: розвитку особистості
ru: развития личности

source: Всього 22%% робочого населення задоволені своєю професією. Тому
ru: Всего 22%% рабочего населения довольны своей профессией. Поэтому

source: важливо вибирати улюблений напрямок діяльності для отримання задоволення від роботи і досягнення
ru: важно выбирать любимое направление деятельности для получения удовольствия от работы и достижения

source: найвищих результатів, наприклад, за допомогою тесту на профорієнтацію
ru: высоких результатов, например, с помощью теста на профориентацию

source: Часто складно знайти улюблену професію, особливо старшокласникам - без реальної робочої практики
ru: Часто сложно найти любимую профессию, особенно старшеклассникам – без реальной рабочей практики

source: не зрозуміти
ru: не понять

source: істинний інтерес до сфери. Але гірше закінчити вуз і після усвідомити "це не моє". Рекомендуємо
ru: истинный интерес к сфере. Но хуже окончить вуз и после осознать "это не мое". Рекомендуем

source: заздалегідь
ru: заранее

source: спробувати попрацювати стажистом і подивитися, як в реальності відбувається процес і чи
ru: попробовать поработать стажером и посмотреть, как в реальности происходит процесс и

source: подобається він
ru: нравится он

source: Неправильно обрану професійну діяльність з часом буде складно змінити через появу
ru: Неправильно выбранную профессиональную деятельность со временем будет сложно изменить из-за появления

source: зобов'язань і складності почати з нуля. Буде потрібно витратити багато часу на перекваліфікацію
ru: обязательств и сложности начать с нуля. Потребуется много времени на переквалификацию

source: роботу на початкових позиціях
ru: работу на начальных позициях

source: Важливо пам'ятати: «Мир прискорюється». І якщо раніше професія частіше була одна і на
ru: Важно помнить: «Мир ускоряется». И если раньше профессия чаще была одна и на

source: все життя, то зараз, швидше
ru: всю жизнь, то сейчас, скорее

source: за все, доведеться змінити кілька. Тому важливо вміти адаптуватися і бути відкритим до нового
ru: всего, придется сменить несколько. Поэтому важно уметь адаптироваться и быть открытым к новому

source: на досягнення високого професіоналізму потрібно багато часу. Андерс Еріксон з Університету штату
ru: на достижение высокого профессионализма требуется много времени. Андерс Эриксон из Университета штата

source: Флорида, довів теорію "для досягнення майстерності в будь-якій справі необхідно 10 000 годин наполегливої практики
ru: Флорида, доказавшая теорию "для достижения мастерства в любом деле необходимо 10 000 часов упорной практики

source: Кількість різних спеціальностей на даний момент - кілька тисяч, у кожної є своя
ru: Количество различных специальностей на данный момент - несколько тысяч, у каждой есть свое

source: специфіка, особливості. Щоб не заплутатися у всьому цьому різноманітті і якось звузити пошуки ідеального
ru: Количество различных специальностей на данный момент - несколько тысяч, у каждой есть свое

source: напрямки, можна пройти тест на профорієнтацію і тест Голланда
ru: направления, можно пройти тест на профориентацию и тест Голланда

source: Всі професії можна розділити на кілька категорій
ru: Все профессии можно разделить на несколько категорий

source: людина (лікарі, викладачі, органи правопорядку, психологи, юристи)
ru: человек (врачи, преподаватели, органы правопорядка, психологи, юристы)

source: природа (ветеринар, еколог, агроном, біолог, геолог)
ru: природа (ветеринар, эколог, агроном, биолог, геолог)

source: техніка (водій, системний адміністратор, зварювальник, токар, автомеханік,
ru: техника (водитель, системный администратор, сварщик, токарь, автомеханик,

source: знакова система (програміст, бухгалтер, економіст, перекладач, математик)
ru: знаковая система (программист, бухгалтер, экономист, переводчик, математик)

source: художні образи (дизайнер, художник, архітектор, актор, режисер)
ru: художественные образы (дизайнер, художник, архитектор, актер, режиссер)

source: Інший варіант тесту Клімова
ru: Другой вариант теста Климова

source: Методика ґрунтується на класифікації професійних інтересів. Дозволяє встановити в якій
ru: Методика основывается на классификации профессиональных интересов. Позволяет установить, в какой

source: галузі старшокласнику найкраще вибрати спеціальність, за якою він проходитиме професійне
ru: отрасли старшекласснику лучше выбрать специальность, по которой онбудет проходить профессиональное

source: навчання після школи
ru: обучение после школы

source: «Карта інтересів» є модифікованим варіантом методики,
ru: «Карта интересов» является модифицированным вариантом методики,

source: опублікований А.Е.Голомштоком у збірнику «Профорієнтаційна робота у школі»
ru: опубликован А.Е.Голомштоком в сборнике «Профориентационная работа в школе»

source: Модифікація зроблена співробітниками ВНДІ профтехосвіти
ru: Модификация сделана сотрудниками ВНИИ профтехобразования

source: Дані, отримані за допомогою цієї методики, виявити не лише коло
ru: Данные, полученные с помощью этой методики, выявить не только круг

source: інтересів учня, а й ступінь їхньої виразності, що має особливе значення у формуванні
ru: интересов ученика, но и степень их выразительности, что имеет особое значение в формировании

source: мотивації вибору майбутньої професії
ru: мотивации выбора будущей профессии

source: Вивчення інтересів, способів учнів може здійснюватись методами
ru: Изучение интересов, способов учащихся может осуществляться методами

source: - від простих спостережень за їх успіхами у освоєнні навчальних дисциплін до використання
ru: - от простых наблюдений за их успехами в освоении учебных дисциплин доиспользования

source: різних анкет, опитувальників. Використання цієї методики дозволяє вперше
ru: различных анкет, опросников. Использование этой методики позволяет впервые

source: проаналізувати інтереси, близькі до того чи іншого виду діяльності
ru: проанализировать интересы, близкие к тому или иному виду деятельности

source: Заповнення банку у відповідь може працювати індивідуально або в групі
ru: Заполнение банка в ответ может работать индивидуально или в группе

source: Методика "Карта інтересів" - опитувальник включає 174 питання, що відображають
ru: Методика "Карта интересов" - опросник включает больше 100 вопросов, которыепоказывают

source: спрямованість інтересів у 19 сферах діяльності
ru: направленность интересов в 19 сферах деятельности

source: Бланк відповідей є матрицею з шести рядків і двадцяти колонок
ru: Бланк ответов является матрицей из шести строк и двадцати колонок

source: Кожна колонка відповідає одній з таких сфер інтересів
ru: Каждая колонка отвечает одной из таких сфер интересов

source: Біологія, хімія
ru: Биология, химия

source: Інформаційні технології
ru: Информационные технологии

source: Фізика, математика
ru: Физика, математика

source: Інженерно-технічна сфера
ru: Инженерно-техническая сфера

source: Будівництво
ru: Строительство

source: Силові структури
ru: Силовые структуры

source: Журналістика
ru: Журналистика

source: Суспільна діяльність
ru: Общественная деятельность

source: Педагогіка
ru: Педагогика

source: Право, юриспруденція
ru: Право, юриспруденция

source: Сфера обслуговування, торгівля
ru: Сфера обслуживания, торговля

source: Економіка та фінанси
ru: Экономика и финансы

source: Іноземні мови
ru: Иностранные языки

source: Образотворче мистецтво, дизайн
ru: Изобразительное искусство, дизайн

source: Музичне та сценічне мистецтво
ru: Музыкальное и сценическое искусство

source: Фізкультура та спорт
ru: Физкультура и спорт

source: Cтислі результати тесту
ru: Короткие результаты теста

source: Професії
ru: Профессии

source: Галузі знань
ru: Области знаний

source: Ви не авторизовані
ru: Вы не авторизованы

source: Залізничні
ru: ЖД

source: Автобусні
ru: Автобусные

source: Звідки
ru: Откуда

source: Куди
ru: Куда

source: Тривалість
ru: Длительность

source: Типи вагонів
ru: Типы вагонов

source: Купити
ru: Купить

source: Фільтрувати
ru: Фильтровать

source: Для результату оберіть університет
ru: Для результата выберите университет

source: Назва
ru: Название

source: Адреса
ru: Адрес

source: Належить ВУЗу
ru: Принадлежит ВУЗу

source: Пошук житла
ru: Поиск жилья

source: Регіон
ru: Регион

source: Місто
ru: Город

source: Університет
ru: Университет

source: Очистити
ru: Очистить

source: ВНЗ
ru: ВУЗ

source: Пошук квитків
ru: Поиск билетов

source: Залізничні квитки
ru: Железнодорожные билеты

source: Автобусні квитки
ru: Автобусные билеты

source: Знайти
ru: Найти

source: Номер поїзду
ru: Номер поезда

source: Сторінку не знайдено
ru: Страница не найдена

source: Перейти до головної
ru: Перейти на главную

source: uk
ru: ru

source: Опитування
ru: Опрос

source: Житло
ru: Жилье

source: Квитки
ru: Билеты

source: ПРОФІЛЬ
ru: Профиль

source: Особисті дані
ru: Персональные данные

source: Збережене
ru: Избранное

source: Вийти
ru: Выйти

source: Реєстрація
ru: Регистрация

source: Вхід
ru: Вход

source: Тест з профорієнтації
ru: Тест по профориентации

source: Опитування для вибору напрямків і спеціальностей відповідних для вас
ru: Опрос для выбора направлений и специальностей подходящих для вас

source: Пошук ВНЗ за обраними параметрами
ru: Поиск вузов по выбранным параметрам

source: Підбір житла на період навчання
ru: Подбор жилья на период обучения

source: Пошук проїзних квитків
ru: Поиск проездных билетов

source: Результати пошуку ВНЗ
ru: Результат поиска ВУЗов

source: Видалити
ru: Удалить

source: Зберiгти
ru: Сохранить

source: Форма власностi
ru: Форма собственности

source: Електронна пошта
ru: Электронная почта

source: Iндекс
ru: Индекс

source: Денна форма навчання
ru: Дневная форма обучения

source: Рiвень
ru: Уровень

source: Спецiальнiсть
ru: Специальность

source: Пропозицiя
ru: Предложение

source: Кiлькiсть бюджетних мiсць
ru: Количество бюджетных мест

source: Кiлькiсть контрактних мiсць
ru: Количество контрактних мест

source: Кiлькiсть балiв на бюджет
ru: Количество баллов на бюджет

source: Кiлькiсть балiв на контракт
ru: Количество баллов на контракт

source: Заочна форма навчання
ru: Заочная форма обучения

source: Пошук по регiонах
ru: Поиск по регионам

source: Усі регiони
ru: Все регионы

source: Усі мiста
ru: Все города

source: Пошук за галузями знань
ru: Поиск по областям знаний

source: Усі галузi знань
ru: Все области знаний

source: Усі спецiальностi
ru: Все специальности

source: Пошук
ru: Поиск

source: Паролі не співпадають
ru: Пароли не совпадают

source: Ім'я вже зайняте
ru: Имя уже занято

source: Заповнення обов'язкове
ru: Заполнение обязательно

source: Пошта вже зайнята
ru: Почта уже занята

source: Некоректна адреса
ru: Некорректный адрес

source: Ім'я користувача
ru: Пользователь

source: До 150 символів. Букви, цифри та @ . + - _
ru: До 150 символов. Буквы, цифры и @ . + - _

source: Пошта
ru: Почта

source: Ваша електронна пошта
ru: Ваша электронная почта

source: Від 8 символів, не повністю з цифр
ru: От 8 символов, не полностью из цифр

source: Підтвердження пароля
ru: Подтверждение пароля

source: Введіть пароль ще раз
ru: Введите пароль еще раз

source: Ім'я
ru: Имя

source: Прізвище
ru: Фамилия

source: Стать
ru: Пол

source: чол
ru: муж

source: чоловіча
ru: мужской

source: жін
ru: жен

source: жіноча
ru: женский

source: н.в.
ru: н.о.

source: не визначено
ru: не определен

source: Введіть номер телефону в міжнародному форматі.
ru: Введите номер в международном формате.

source: Виконано вихід з акаунту
ru: Выполнен выход из аккаунта

source: Увійти знов
ru: Войти снова

source: Ім'я користувача або пошта
ru: Имя пользователя или почта

source: Невірні дані для входу
ru: Неверные данные для входа

source: Увійти
ru: Войти

source: Відновити пароль
ru: Восстановить пароль

source: Зареєструватись
ru: Регистрация

source: Пароль змінено
ru: Пароль изменен

source: Будь ласка, введіть новий пароль
ru: Пожалуйста, введите новый пароль

source: Новий пароль
ru: Новый пароль

source: Змінити пароль
ru: Изменить пароль

source: Невдала зміна пароля
ru: Неудачная смена пароля

source: Неправильне посилання на зміну пароля
ru: Неверная ссылка на изменение пароля

source: Можливо, воно вже було використано
ru: Возможно, оно уже было использовано

source: Інструкції зі зміни пароля були надіслані на електронну пошту
ru: Инструкции по изменению пароля были отправлены на электронную почту

source: Хтось попросив скинути пароль для електронної пошти
ru: Кто-то запросил сброс пароля для электронной почты

source: Перейдіть за посиланням нижче
ru: Перейдите по ссылке ниже

source: Введіть електронну пошту, на яку буде надіслано посилання для зміни пароля
ru: Введите электронную почту, на которую будет отправлена ссылка для изменения пароля.

source: Зареєструвати
ru: Зарегестрировать

source: Профіль
ru: Профиль

source: Персональні дані
ru: Личные данные

source: Історія опитувань
ru: История опросов

source: Результати відсутні
ru: Результаты отсутствуют

source: Пройти опитування
ru: Пройти опрос

source: Збереженi ВHЗ
ru: Избранное

source: Опис
ru: Описание

source: Приклади
ru: Примеры

source: Змінити
ru: Изменить

source: ЗБЕРЕГТИ
ru: Сохранить
